<details><summary>Show Plan</summary>

```

terraform
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
module.database_cluster.random_id.snapshot_identifier[0]: Refreshing state... [id=g8r2jg]
module.database_cluster.random_password.master_password[0]: Refreshing state... [id=none]
module.tenant_database_cluster.random_password.master_password[0]: Refreshing state... [id=none]
module.tenant_database_cluster.random_id.snapshot_identifier[0]: Refreshing state... [id=FC30PA]
module.monitoring.grafana_data_source.cloudwatch: Refreshing state... [id=70]
data.github_release.latest_release: Reading...
data.github_release.latest_release: Read complete after 0s [id=95815367]
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
data.aws_ecr_repository.repository: Reading...
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging-push_logs]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/511c1c1e-eace-4166-b7c1-9bbfc82c70f6]
module.database_cluster.data.aws_partition.current: Reading...
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03d2024cd76f87de7]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.database_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.tenant_database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-9d5a7caf-e591-4fc3-9b8b-395ecc554a78]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.tenant_database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.tenant_database_cluster.data.aws_partition.current: Reading...
module.tenant_database_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.data.aws_iam_policy_document.otel: Reading...
module.ecs.data.aws_iam_policy_document.otel: Read complete after 0s [id=1623705645]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cf37ffc0ce81b1aa]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging-push-ecs-task-execution-role]
data.aws_ecr_repository.aws_otel_collector: Reading...
module.ecs.aws_iam_policy.otel: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging-push-otel]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310513400000004]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310106100000002]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310626000000005]
module.ecs.aws_iam_role_policy_attachment.ssm_read_only_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221206230156280200000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_xray_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310311900000003]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_fetch_ghcr_secret_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221206230157544800000002]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging-push]
data.aws_ecr_repository.aws_otel_collector: Read complete after 1s [id=aws-otel-collector]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z04987691W18X63LDNXVM]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z04987691W18X63LDNXVM__9407f2eddc416d7cd8c8ee599f0a5c6a.staging.echo.walletconnect.com._CNAME]
module.monitoring.grafana_data_source.prometheus: Refreshing state... [id=71]
data.aws_ecr_repository.repository: Read complete after 1s [id=echo-server]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-070f71778957ad172]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-push-target-group/4e313fa6a28675a6]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dabd56e1ee9f13d5]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00c3da4dd2356a722]
module.ecs.aws_security_group.lb_ingress: Refreshing state... [id=sg-09a393bfda92ce73c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0481f853db59b18ab]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096e43f33feb7bad8]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-020d4227523193719]
module.database_cluster.aws_security_group.this[0]: Refreshing state... [id=sg-0e16ed5ca4c08ad1f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0237d5132685aec74]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01b56529aabb62ca4]
module.tenant_database_cluster.aws_security_group.this[0]: Refreshing state... [id=sg-0ce11b7546d3b6906]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-030e538b0cb0a6d8e]
module.ecs.aws_security_group.app_ingress: Refreshing state... [id=sg-0204db9e1b9eeeade]
module.database_cluster.aws_db_subnet_group.this[0]: Refreshing state... [id=staging-push-database]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00ddd51caea6541c4]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-061e6ac209de357b8]
module.database_cluster.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-804588316]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03e6492222243f584]
module.tenant_database_cluster.aws_db_subnet_group.this[0]: Refreshing state... [id=staging-push-tenant-database]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07621fa7fde207073]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-089e0e3b3a4cf63c2]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f4d707d2387daf8d]
module.tenant_database_cluster.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-3979038549]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01b56529aabb62ca41080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0210fd7627e6a6303]
module.ecs.aws_lb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-push-load-balancer/aea5ef9d0a34453a]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-070f71778957ad1721080289494]
module.monitoring.grafana_dashboard.at_a_glance: Refreshing state... [id=0:staging-push]
module.ecs.aws_lb_listener.listener-http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/b671fd955200d192]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z04987691W18X63LDNXVM_staging.echo.walletconnect.com_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/171b42a3340fa814]
module.database_cluster.aws_rds_cluster.this[0]: Refreshing state... [id=staging-push-database]
module.tenant_database_cluster.aws_rds_cluster.this[0]: Refreshing state... [id=staging-push-tenant-database]
module.database_cluster.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=staging-push-database-1]
module.tenant_database_cluster.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=staging-push-tenant-database-1]
module.ecs.aws_ecs_task_definition.app_task_definition: Refreshing state... [id=staging-push]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.analytics.aws_kms_alias.analytics_bucket will be created
  + resource "aws_kms_alias" "analytics_bucket" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/analytics/push/staging"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.analytics.aws_kms_key.analytics_bucket will be created
  + resource "aws_kms_key" "analytics_bucket" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "push.staging - analytics bucket encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket" "analytics-data-lake_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "walletconnect.push.staging.analytics.data-lake"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl will be created
  + resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service"
        name                               = "staging-push-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:56" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:56" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging-push" -> (known after apply)
      ~ revision                 = 56 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_policy.analytics-data-lake_bucket_access will be created
  + resource "aws_iam_policy" "analytics-data-lake_bucket_access" {
      + arn         = (known after apply)
      + description = "Allows staging-push to read/write from walletconnect.push.staging.analytics.data-lake"
      + id          = (known after apply)
      + name        = "staging-push_analytics-data-lake_bucket_access"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.ecs.aws_iam_policy.geoip_bucket_access will be created
  + resource "aws_iam_policy" "geoip_bucket_access" {
      + arn         = (known after apply)
      + description = "Allows staging-push to read from staging.relay.geo.ip.database.private.staging.walletconnect"
      + id          = (known after apply)
      + name        = "staging-push_geoip_bucket_access"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect",
                        ]
                      + Sid      = "ListObjectsInGeoipBucket"
                    },
                  + {
                      + Action   = [
                          + "s3:CopyObject",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect/*",
                        ]
                      + Sid      = "AllObjectActionsInGeoipBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "analytics-data-lake-bucket-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-push-ecs-task-execution-role"
    }

  # module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "geoip-bucket-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-push-ecs-task-execution-role"
    }

  # module.monitoring.grafana_data_source.cloudwatch will be updated in-place
  ~ resource "grafana_data_source" "cloudwatch" {
        id                 = "70"
      ~ json_data_encoded  = jsonencode(
          ~ {
              - manageAlerts  = false
              - sigV4Auth     = false
              - timescaledb   = false
              - xpack         = false
                # (1 unchanged attribute hidden)
            }
        )
        name               = "staging-push-cloudwatch"
        # (6 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - default_region                = "eu-central-1" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = false -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

  # module.monitoring.grafana_data_source.prometheus will be updated in-place
  ~ resource "grafana_data_source" "prometheus" {
        id                 = "71"
      ~ json_data_encoded  = jsonencode(
          ~ {
              - timescaledb   = false
              - xpack         = false
                # (5 unchanged attributes hidden)
            }
        )
        name               = "staging-push-amp"
        # (7 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - http_method                   = "GET" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = true -> null
          - sigv4_auth_type               = "workspace-iam-role" -> null
          - sigv4_region                  = "eu-central-1" -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

Plan: 12 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*